let 亂數 = 0
let 角色1: Sprite = null
let 角色2: Sprite = null
let 角色3: Sprite = null
let 角色4: Sprite = null
forever(function () {
    亂數 = randint(1, 4)
    if (亂數 == 1) {
        角色1 = sprites.create(img`
            . . . . . . . . . . . . . . . . 
            . . . . . . . . . . . . . . . . 
            . . . . . . . . . . . . . . . . 
            . . . . . . . . . . . . . . . . 
            . . . . . . . . . . . . . . . . 
            . . . . . . . . . . . . . . . . 
            . . . . . . 3 3 3 . . . . . . . 
            . . . . . 3 3 3 3 . . . . . . . 
            . . . . . 3 3 3 . . . . . . . . 
            . . . . . 3 3 3 . . . . . . . . 
            . . . . . . . . . . . . . . . . 
            . . . . . . . . . . . . . . . . 
            . . . . . . . . . . . . . . . . 
            . . . . . . . . . . . . . . . . 
            . . . . . . . . . . . . . . . . 
            . . . . . . . . . . . . . . . . 
            `, SpriteKind.Player)
        角色1.setPosition(0, randint(0, 100))
        角色1.setVelocity(100, 0)
        pause(1000)
        角色1.setFlag(SpriteFlag.DestroyOnWall, true)
    }
    if (亂數 == 2) {
        角色2 = sprites.create(img`
            . . . . . . . . . . . . . . . . 
            . . . . . . . . . . . . . . . . 
            . . . . . . . . . . . . . . . . 
            . . . . . . . . . . . . . . . . 
            . . . . . . . . . . . . . . . . 
            . . . . . . . . . . . . . . . . 
            . . . . . . c c c . . . . . . . 
            . . . . . c c c c . . . . . . . 
            . . . . . c c c c . . . . . . . 
            . . . . . c c c . . . . . . . . 
            . . . . . . . . . . . . . . . . 
            . . . . . . . . . . . . . . . . 
            . . . . . . . . . . . . . . . . 
            . . . . . . . . . . . . . . . . 
            . . . . . . . . . . . . . . . . 
            . . . . . . . . . . . . . . . . 
            `, SpriteKind.Player)
        角色2.setPosition(0, randint(0, 100))
        角色2.setVelocity(100, 0)
        pause(1000)
        角色2.setFlag(SpriteFlag.DestroyOnWall, true)
    }
    if (亂數 == 3) {
        角色3 = sprites.create(img`
            . . . . . . . . . . . . . . . . 
            . . . . . . . . . . . . . . . . 
            . . . . . . . . . . . . . . . . 
            . . . . . . . . . . . . . . . . 
            . . . . . . . . . . . . . . . . 
            . . . . . . . . . . . . . . . . 
            . . . . . . 5 5 5 5 . . . . . . 
            . . . . . 5 5 5 5 . . . . . . . 
            . . . . . 5 5 5 . . . . . . . . 
            . . . . . 5 5 5 . . . . . . . . 
            . . . . . . . . . . . . . . . . 
            . . . . . . . . . . . . . . . . 
            . . . . . . . . . . . . . . . . 
            . . . . . . . . . . . . . . . . 
            . . . . . . . . . . . . . . . . 
            . . . . . . . . . . . . . . . . 
            `, SpriteKind.Player)
        角色3.setPosition(0, randint(0, 100))
        角色3.setVelocity(100, 0)
        角色3.setVelocity(100, 0)
        pause(1000)
        角色3.setFlag(SpriteFlag.DestroyOnWall, true)
    }
    if (亂數 == 4) {
        角色4 = sprites.create(img`
            . . . . . . . . . . . . . . . . 
            . . . . . . . . . . . . . . . . 
            . . . . . . . . . . . . . . . . 
            . . . . . . . . . . . . . . . . 
            . . . . . . . . . . . . . . . . 
            . . . . . . . . . . . . . . . . 
            . . . . . . 2 2 2 . . . . . . . 
            . . . . 2 2 2 2 2 . . . . . . . 
            . . . . 2 2 2 2 . . . . . . . . 
            . . . . . 2 2 2 . . . . . . . . 
            . . . . . . . . . . . . . . . . 
            . . . . . . . . . . . . . . . . 
            . . . . . . . . . . . . . . . . 
            . . . . . . . . . . . . . . . . 
            . . . . . . . . . . . . . . . . 
            . . . . . . . . . . . . . . . . 
            `, SpriteKind.Player)
        角色4.setPosition(0, randint(0, 100))
        角色4.setVelocity(100, 0)
        pause(1000)
        角色4.setFlag(SpriteFlag.DestroyOnWall, true)
    }
})
